ExperimentResults/single-producer-to-consumer.txt
58658 records sent, 11576.5 records/sec (11.04 MB/sec), 594.3 ms avg latency, 1318.0 ms max latency.
101052 records sent, 18737.6 records/sec (17.87 MB/sec), 1885.9 ms avg latency, 3007.0 ms max latency.
122094 records sent, 24384.7 records/sec (23.26 MB/sec), 2861.7 ms avg latency, 4652.0 ms max latency.
55314 records sent, 11056.2 records/sec (10.54 MB/sec), 3528.2 ms avg latency, 7234.0 ms max latency.
24696 records sent, 4929.3 records/sec (4.70 MB/sec), 7962.8 ms avg latency, 10894.0 ms max latency.
49266 records sent, 9841.4 records/sec (9.39 MB/sec), 9300.0 ms avg latency, 13735.0 ms max latency.
72828 records sent, 14330.6 records/sec (13.67 MB/sec), 5499.6 ms avg latency, 13305.0 ms max latency.
122850 records sent, 24560.2 records/sec (23.42 MB/sec), 3251.3 ms avg latency, 7645.0 ms max latency.
34650 records sent, 5894.9 records/sec (5.62 MB/sec), 3669.3 ms avg latency, 7109.0 ms max latency.
53550 records sent, 10707.9 records/sec (10.21 MB/sec), 8810.5 ms avg latency, 11870.0 ms max latency.
98784 records sent, 19701.6 records/sec (18.79 MB/sec), 4259.0 ms avg latency, 12079.0 ms max latency.
72576 records sent, 14405.7 records/sec (13.74 MB/sec), 3367.6 ms avg latency, 7557.0 ms max latency.
8190 records sent, 1635.1 records/sec (1.56 MB/sec), 7990.4 ms avg latency, 12076.0 ms max latency.
52038 records sent, 10399.3 records/sec (9.92 MB/sec), 9802.4 ms avg latency, 14618.0 ms max latency.
26838 records sent, 5359.0 records/sec (5.11 MB/sec), 8840.0 ms avg latency, 18060.0 ms max latency.
50904 records sent, 10164.5 records/sec (9.69 MB/sec), 8914.8 ms avg latency, 19247.0 ms max latency.
49014 records sent, 9795.0 records/sec (9.34 MB/sec), 7497.4 ms avg latency, 14320.0 ms max latency.
60480 records sent, 12071.9 records/sec (11.51 MB/sec), 5756.1 ms avg latency, 13300.0 ms max latency.
18522 records sent, 3686.7 records/sec (3.52 MB/sec), 6585.8 ms avg latency, 11008.0 ms max latency.
36792 records sent, 7355.5 records/sec (7.01 MB/sec), 10624.0 ms avg latency, 15346.0 ms max latency.
48258 records sent, 9643.9 records/sec (9.20 MB/sec), 8630.8 ms avg latency, 16602.0 ms max latency.
53424 records sent, 10684.8 records/sec (10.19 MB/sec), 6681.7 ms avg latency, 16321.0 ms max latency.
13608 records sent, 2621.5 records/sec (2.50 MB/sec), 7878.4 ms avg latency, 14424.0 ms max latency.
36666 records sent, 7309.8 records/sec (6.97 MB/sec), 11601.1 ms avg latency, 15296.0 ms max latency.
40194 records sent, 7881.2 records/sec (7.52 MB/sec), 10642.2 ms avg latency, 16919.0 ms max latency.
46746 records sent, 9196.5 records/sec (8.77 MB/sec), 7615.7 ms avg latency, 16888.0 ms max latency.
25578 records sent, 5114.6 records/sec (4.88 MB/sec), 8835.5 ms avg latency, 13636.0 ms max latency.
32130 records sent, 6399.1 records/sec (6.10 MB/sec), 9799.5 ms avg latency, 15351.0 ms max latency.
38052 records sent, 7610.4 records/sec (7.26 MB/sec), 10470.7 ms avg latency, 16953.0 ms max latency.
53298 records sent, 10625.6 records/sec (10.13 MB/sec), 8578.4 ms avg latency, 17076.0 ms max latency.
74970 records sent, 14994.0 records/sec (14.30 MB/sec), 5300.0 ms avg latency, 12464.0 ms max latency.
68922 records sent, 13776.1 records/sec (13.14 MB/sec), 4059.6 ms avg latency, 7293.0 ms max latency.
20538 records sent, 3711.9 records/sec (3.54 MB/sec), 5834.3 ms avg latency, 10241.0 ms max latency.
38052 records sent, 7523.1 records/sec (7.17 MB/sec), 10683.0 ms avg latency, 14244.0 ms max latency.
49140 records sent, 9810.3 records/sec (9.36 MB/sec), 8912.7 ms avg latency, 14681.0 ms max latency.
8946 records sent, 1778.5 records/sec (1.70 MB/sec), 8485.7 ms avg latency, 15530.0 ms max latency.
25200 records sent, 5039.0 records/sec (4.81 MB/sec), 12674.6 ms avg latency, 16334.0 ms max latency.
22302 records sent, 4355.0 records/sec (4.15 MB/sec), 14683.1 ms avg latency, 19072.0 ms max latency.
33138 records sent, 6593.3 records/sec (6.29 MB/sec), 13944.2 ms avg latency, 21024.0 ms max latency.
11844 records sent, 2368.8 records/sec (2.26 MB/sec), 13725.9 ms avg latency, 23725.0 ms max latency.
33138 records sent, 6627.6 records/sec (6.32 MB/sec), 13948.4 ms avg latency, 22806.0 ms max latency.
18270 records sent, 3648.9 records/sec (3.48 MB/sec), 13399.8 ms avg latency, 20296.0 ms max latency.
5796 records sent, 1125.2 records/sec (1.07 MB/sec), 14095.3 ms avg latency, 23491.0 ms max latency.
35406 records sent, 7071.3 records/sec (6.74 MB/sec), 16914.6 ms avg latency, 24833.0 ms max latency.
34272 records sent, 6821.7 records/sec (6.51 MB/sec), 14017.2 ms avg latency, 20711.0 ms max latency.
20412 records sent, 4009.4 records/sec (3.82 MB/sec), 11800.0 ms avg latency, 20820.0 ms max latency.
3780 records sent, 654.8 records/sec (0.62 MB/sec), 14784.3 ms avg latency, 23305.0 ms max latency.
23436 records sent, 4539.2 records/sec (4.33 MB/sec), 18513.8 ms avg latency, 23233.0 ms max latency.
65520 records sent, 13101.4 records/sec (12.49 MB/sec), 13044.6 ms avg latency, 22639.0 ms max latency.
69552 records sent, 11624.9 records/sec (11.09 MB/sec), 4615.6 ms avg latency, 16869.0 ms max latency.
59220 records sent, 11834.5 records/sec (11.29 MB/sec), 6931.7 ms avg latency, 8981.0 ms max latency.
96894 records sent, 19317.0 records/sec (18.42 MB/sec), 3755.8 ms avg latency, 8585.0 ms max latency.
71694 records sent, 14324.5 records/sec (13.66 MB/sec), 3873.1 ms avg latency, 6354.0 ms max latency.
36036 records sent, 7197.1 records/sec (6.86 MB/sec), 5833.4 ms avg latency, 9292.0 ms max latency.
11970 records sent, 2382.6 records/sec (2.27 MB/sec), 9464.8 ms avg latency, 13506.0 ms max latency.
22680 records sent, 3219.3 records/sec (3.07 MB/sec), 11630.5 ms avg latency, 18183.0 ms max latency.
68748 records sent, 13738.6 records/sec (13.10 MB/sec), 12116.6 ms avg latency, 21785.0 ms max latency.
129386 records sent, 25866.9 records/sec (24.67 MB/sec), 3274.6 ms avg latency, 16897.0 ms max latency.
77080 records sent, 15333.2 records/sec (14.62 MB/sec), 3309.4 ms avg latency, 6788.0 ms max latency.
104690 records sent, 20912.9 records/sec (19.94 MB/sec), 3840.0 ms avg latency, 7865.0 ms max latency.
87066 records sent, 17413.2 records/sec (16.61 MB/sec), 3331.4 ms avg latency, 6494.0 ms max latency.
85806 records sent, 16629.1 records/sec (15.86 MB/sec), 3512.8 ms avg latency, 7028.0 ms max latency.
121842 records sent, 24344.1 records/sec (23.22 MB/sec), 3389.0 ms avg latency, 7862.0 ms max latency.
85806 records sent, 17161.2 records/sec (16.37 MB/sec), 3309.4 ms avg latency, 6887.0 ms max latency.
80640 records sent, 16128.0 records/sec (15.38 MB/sec), 3814.3 ms avg latency, 7826.0 ms max latency.
5796 records sent, 984.7 records/sec (0.94 MB/sec), 5462.1 ms avg latency, 11388.0 ms max latency.
21798 records sent, 4354.4 records/sec (4.15 MB/sec), 12384.0 ms avg latency, 16822.0 ms max latency.
33642 records sent, 6725.7 records/sec (6.41 MB/sec), 12026.3 ms avg latency, 19955.0 ms max latency.
12726 records sent, 2336.3 records/sec (2.23 MB/sec), 10415.0 ms avg latency, 20855.0 ms max latency.
20034 records sent, 4006.0 records/sec (3.82 MB/sec), 15961.1 ms avg latency, 28898.0 ms max latency.
63000 records sent, 12597.5 records/sec (12.01 MB/sec), 11639.6 ms avg latency, 29922.0 ms max latency.
60102 records sent, 12020.4 records/sec (11.46 MB/sec), 7405.7 ms avg latency, 22310.0 ms max latency.
55652 records sent, 11121.5 records/sec (10.61 MB/sec), 6027.4 ms avg latency, 14482.0 ms max latency.
47820 records sent, 5726.9 records/sec (5.46 MB/sec), 4998.7 ms avg latency, 11572.0 ms max latency.
94075 records sent, 18807.5 records/sec (17.94 MB/sec), 6512.8 ms avg latency, 16143.0 ms max latency.
95922 records sent, 19161.4 records/sec (18.27 MB/sec), 4622.8 ms avg latency, 14820.0 ms max latency.
111929 records sent, 22367.9 records/sec (21.33 MB/sec), 2966.0 ms avg latency, 8823.0 ms max latency.
125518 records sent, 25093.6 records/sec (23.93 MB/sec), 2579.2 ms avg latency, 7468.0 ms max latency.
58149 records sent, 11379.5 records/sec (10.85 MB/sec), 3430.5 ms avg latency, 9356.0 ms max latency.
31878 records sent, 6359.1 records/sec (6.06 MB/sec), 7515.4 ms avg latency, 13579.0 ms max latency.
35406 records sent, 4343.8 records/sec (4.14 MB/sec), 6994.2 ms avg latency, 16218.0 ms max latency.
34584 records sent, 6912.7 records/sec (6.59 MB/sec), 8972.7 ms avg latency, 25126.0 ms max latency.
119856 records sent, 23971.2 records/sec (22.86 MB/sec), 6564.1 ms avg latency, 26722.0 ms max latency.
97776 records sent, 19555.2 records/sec (18.65 MB/sec), 3320.0 ms avg latency, 18504.0 ms max latency.
38023 records sent, 6423.9 records/sec (6.13 MB/sec), 2377.9 ms avg latency, 9740.0 ms max latency.
114622 records sent, 22919.8 records/sec (21.86 MB/sec), 5057.4 ms avg latency, 14211.0 ms max latency.
104739 records sent, 20876.8 records/sec (19.91 MB/sec), 3647.9 ms avg latency, 13927.0 ms max latency.
65367 records sent, 13070.8 records/sec (12.47 MB/sec), 4076.0 ms avg latency, 11805.0 ms max latency.
104947 records sent, 20981.0 records/sec (20.01 MB/sec), 3874.6 ms avg latency, 12673.0 ms max latency.
75549 records sent, 14539.8 records/sec (13.87 MB/sec), 6216.8 ms avg latency, 10997.0 ms max latency.
5000000 records sent, 10554.156543 records/sec (10.07 MB/sec), 6072.93 ms avg latency, 29922.00 ms max latency, 4703 ms 50th, 16624 ms 95th, 22323 ms 99th, 29190 ms 99.9th.